app/views/groups/show.html.erb

  <ul>
    <% @group.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "group_memberships" ON "users"."id" = "group_memberships"."user_id" WHERE "group_memberships"."group_id" = $1  [["group_id", 1]]


<% @group.images.each do |image| %>
---
SELECT "images".* FROM "images" INNER JOIN "groups_images" ON "images"."id" = "groups_images"."image_id" WHERE "groups_images"."group_id" = $1  [["group_id", 6]]