app/views/dashboards/show.html.erb

  <ul>
    <% current_user.images.each do |image| %>
---
SELECT "images".* FROM "images" INNER JOIN "likes" ON "images"."id" = "likes"."image_id" WHERE "likes"."user_id" = $1  [["user_id", 5]]