app/controllers/comments_controller.rb

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "created_at", "image_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "yea"], ["created_at", "2014-10-13 19:50:48.811379"], ["image_id", 1], ["updated_at", "2014-10-13 19:50:48.811379"], ["user_id", 2]]
---
  def create
    @image = Image.find(params[:image_id])
    @comment = @image.comments.build(find_image_params)
    if @comment.save