app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    gallery = Gallery.create(find_gallery_params)
---
INSERT INTO "galleries" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-06 20:42:07.983166"], ["description", "Ruffle"], ["name", "Adam"], ["updated_at", "2014-10-06 20:42:07.983166"]]

 def destroy
   gallery = Gallery.find(params[:id])
   gallery.delete
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "galleries" WHERE "galleries"."id" = 4

 def edit
   @gallery = Gallery.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]

 def update
   gallery = Gallery.find(params[:id])
   gallery.update(find_gallery_params)
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "galleries" SET "cover_image" = $1, "updated_at" = $2 WHERE "galleries"."id" = 9  [["cover_image", "http://gottalovealab.com/images/yellow-lab-names.jpg"], ["updated_at", "2014-10-07 21:28:31.352819"]]