app/controllers/group_memberships_controller.rb

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    group = Group.find(params[:id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @group = Group.find(params[:id])