app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @group.save
---
INSERT INTO "groups" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-14 20:40:44.815524"], ["description", "YOLO"], ["name", "Adams"], ["updated_at", "2014-10-14 20:40:44.815524"]]

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = 1