app/controllers/images_controller.rb

  def new
    @gallery = Gallery.find(params[:gallery_id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]

  def create
    @gallery = Gallery.find(params[:gallery_id])
    @image = @gallery.images.new(find_image_params)

    if @image.save
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "images" ("created_at", "description", "gallery_id", "name", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @image = Image.find(params[:id])
    @gallery = Gallery.find(params[:gallery_id])
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]

  def edit
    @gallery = Gallery.find(params[:gallery_id])
    @image = Image.find(params[:id])
---
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @image = Image.find(params[:id])
    @gallery = Gallery.find(params[:gallery_id])

    if @image.update(find_image_params)
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "images" SET "description" = $1, "updated_at" = $2 WHERE "images"."id" = 1  [["description", "Awesome stuff"], ["updated_at", "2014-10-08 03:21:18.717285"]]

  def destroy
    image = Image.find(params[:id])
    gallery = Gallery.find(params[:gallery_id])
    image.destroy
---
SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "galleries".* FROM "galleries"  WHERE "galleries"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 1]]