app/controllers/likes_controller.rb

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 15]]
INSERT INTO "likes" ("created_at", "image_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-15 21:38:18.113842"], ["image_id", 15], ["updated_at", "2014-10-15 21:38:18.113842"], ["user_id", 5]]
---
  def create
    @image = Image.find(params[:image_id])
    current_user.liked_images << @image

SELECT  "images".* FROM "images"  WHERE "images"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."image_id" = 1  [["user_id", 1]]
---
  def destroy
    @image = Image.find(params[:image_id])
    current_user.liked_images.delete(@image)