app/views/galleries/show.html.erb

<br>
  <% @gallery.images.each do |image| %>
---
SELECT "images".* FROM "images"  WHERE "images"."gallery_id" = $1  [["gallery_id", 9]]