app/views/images/_form.html.erb

  <div>
    <%= form.collection_check_boxes :group_ids, current_user.groups, :id, :name %>
---
SELECT "groups".* FROM "groups" INNER JOIN "group_memberships" ON "groups"."id" = "group_memberships"."group_id" WHERE "group_memberships"."user_id" = $1  [["user_id", 5]]