app/views/images/show.html.erb


<% if current_user.liked_images.include? @image %>
---
SELECT  1 AS one FROM "images" INNER JOIN "likes" ON "images"."id" = "likes"."image_id" WHERE "likes"."user_id" = $1 AND "images"."id" = 15 LIMIT 1  [["user_id", 1]]

<div>
  <p>Likes: <%= @image.likes.count %> </p>
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."image_id" = $1  [["image_id", 15]]